Revit 2027 API
IDirectContext3DServer.GetBoundingBox Method
 Reports a bounding box of the geometry that this server submits for drawing.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Outline GetBoundingBox(
	View dBView
)
Function GetBoundingBox (
	dBView As View
) As Outline
Outline^ GetBoundingBox(
	View^ dBView
)
abstract GetBoundingBox :
        dBView : View -> Outline
Parameters
dBView View
 The view where rendering will occur. If this argument is null, a view-independent bounding box should be reported.
Return Value
Outline
 The bounding box as an Outline.
Remarks
Revit uses the bounding box when navigating views, e.g., when a Zoom to Fit command is issued. The reported bounding box does not have to be tight. However, there may be unintended side-effects if the box is inconsistent with the submitted geometry.
See Also
Reference
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace